[
    {
        "id":"01",
        "image": "https://adrianmejia.com/images/time-complexity-examples.png",
        "title": "Algorithms and complexity.",
        "details":"Finding out the time complexity of your code can help you develop better programs that run faster. Some functions are easy to analyze, but when you have loops, and recursion might get a little trickier when you have recursion. After reading this post, you are able to derive the time complexity of any code.In general, you can determine the time complexity by analyzing the program’s statements (go line by line). However, you have to be mindful how are the statements arranged. Suppose they are inside a loop or have function calls or even recursion. All these factors affect the runtime of your code. Let’s see how to deal with these cases.",
        "course-duration": "6 month",
        "batch":"05",
        "admit-lastDate":"30 October 2022"
    },

    {
        "id":"02",
        "image": "https://i.ytimg.com/vi/Ol8D69VKX2k/maxresdefault.jpg",
        "title": "Architecture and organization.",
        "details":"Computer architecture deals with the design of computers, data storage devices, and networking components that store and run programs, transmit data, and drive interactions between computers, across networks, and with users.",
        "course-duration": "6 month",
        "batch":"05",
        "admit-lastDate":"30 October 2022"
    },

    {
        "id":"02",
        "image": "https://www.analyticssteps.com/backend/media/thumbnail/7683392/4037952_1623731066_Computational-ScienceArtboard-1.png",
        "title": "Computational science.",
        "details":"Please note that computational science is different from computer science. At the risk of oversimplifying things, one can say that computer science is about the science of computers whereas computational science is about the use of computers to solve science and engineering problems.",
        "course-duration": "6 month",
        "batch":"05",
        "admit-lastDate":"30 October 2022"
    }
]